---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.Alignment.DisplayedStartStation
source: html/0a17ad4e-4a52-a955-c1af-882e2123bf49.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.DisplayedStartStation Property

Specifies the station at which the alignment's display starts, in Revit internal model units (standard Imperial feet).

## Syntax (C#)
```csharp
public double DisplayedStartStation { get; }
```

## Remarks
This station is within the alignment's geometric definition range ( StartStation , EndStation ).